class Особа:
    def __init__(self, ім_я, вік):
        self.ім_я = ім_я
        self._вік = вік

    def вік(self):
        return self._вік


class Водій(Особа):
    def __init__(self, ім_я, вік, номер_посвідчення):
        super().__init__(ім_я, вік)
        self.номер_посвідчення = номер_посвідчення


if __name__ == "__main__":
    водій = Водій("Олександр", 35, "XX987654")

    print(f"Ім'я: {водій.ім_я}")
    print(f"Вік: {водій.вік()}")
    print(f"Номер водійського посвідчення: {водій.номер_посвідчення}")